{"11":{"id":11,"title":"Star Wars","year":"1977","genre":"Action, Adventure, Fantasy, Sci-Fi","director":"George Lucas","actor":"Mark Hamill, Harrison Ford, Carrie Fisher, Alec Guinness","plot":"Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a wookiee and two droids to save the universe from the Empire's world-destroying battle-station, while also attempting to rescue Princess Leia from the evil Darth Vader.","imdbScore":"8.8","wasLiked":false},"12":{"id":12,"title":"Finding Nemo","year":"2003","genre":"Animation, Adventure, Comedy, Family","director":"Andrew Stanton, Lee Unkrich","actor":"Albert Brooks, Ellen DeGeneres, Alexander Gould, Willem Dafoe","plot":"After his son is captured in the Great Barrier Reef and taken to Sydney, a timid clownfish sets out on a journey to bring him home.","imdbScore":"8.1","wasLiked":false},"13":{"id":13,"title":"Forrest Gump","year":"1994","genre":"Drama, Romance","director":"Robert Zemeckis","actor":"Tom Hanks, Robin Wright, Gary Sinise, Sally Field","plot":"Forrest Gump, while not intelligent, has accidentally been present at many historic moments, but his true love, Jenny Curran, eludes him.","imdbScore":"8.7","wasLiked":false},"14":{"id":14,"title":"American Beauty","year":"1999","genre":"Drama","director":"Sam Mendes","actor":"Kevin Spacey, Annette Bening, Thora Birch, Wes Bentley","plot":"Lester Burnham, a depressed suburban father in a mid-life crisis, decides to turn his hectic life around after developing an infatuation for his daughter's attractive friend.","imdbScore":"8.5","wasLiked":false},"22":{"id":22,"title":"Pirates of the Caribbean: The Curse of the Black Pearl","year":"2003","genre":"Action, Adventure, Fantasy","director":"Gore Verbinski","actor":"Johnny Depp, Geoffrey Rush, Orlando Bloom, Keira Knightley","plot":"Blacksmith Will Turner teams up with eccentric pirate 'Captain' Jack Sparrow to save his love, the governor's daughter, from Jack's former pirate allies, who are now undead.","imdbScore":"8.0","wasLiked":false},"24":{"id":24,"title":"Kill Bill: Vol. 1","year":"2003","genre":"Action, Crime","director":"Quentin Tarantino","actor":"Uma Thurman, David Carradine, Daryl Hannah, Michael Madsen","plot":"The Bride wakens from a four-year coma. The child she carried in her womb is gone. Now she must wreak vengeance on the team of assassins who betrayed her - a team she was once part of.","imdbScore":"8.2","wasLiked":false},"38":{"id":38,"title":"Eternal Sunshine of the Spotless Mind","year":"2004","genre":"Drama, Romance, Sci-Fi","director":"Michel Gondry","actor":"Jim Carrey, Kate Winslet, Tom Wilkinson, Gerry Robert Byrne","plot":"A couple undergo a procedure to erase each other from their memories when their relationship turns sour, but it is only through the process of loss that they discover what they had to begin with.","imdbScore":"8.4","wasLiked":false},"63":{"id":63,"title":"Twelve Monkeys","year":"1995","genre":"Mystery, Sci-Fi, Thriller","director":"Terry Gilliam","actor":"Bruce Willis, Madeleine Stowe, Brad Pitt, Joseph Melito","plot":"In a future world devastated by disease, a convict is sent back in time to gather information about the man-made virus that wiped out most of the human population on the planet.","imdbScore":"8.1","wasLiked":false},"77":{"id":77,"title":"Memento","year":"2000","genre":"Mystery, Thriller","director":"Christopher Nolan","actor":"Guy Pearce, Carrie-Anne Moss, Joe Pantoliano, Mark Boone Junior","plot":"A man, suffering from short-term memory loss, uses notes and tattoos to hunt for the man he thinks killed his wife.","imdbScore":"8.6","wasLiked":false},"85":{"id":85,"title":"Raiders of the Lost Ark","year":"1981","genre":"Action, Adventure","director":"Steven Spielberg","actor":"Harrison Ford, Karen Allen, Paul Freeman, John Rhys-Davies","plot":"Archeologist and adventurer Indiana Jones is hired by the US government to find the Ark of the Covenant before the Nazis.","imdbScore":"8.6","wasLiked":false},"98":{"id":98,"title":"Gladiator","year":"2000","genre":"Action, Adventure, Drama","director":"Ridley Scott","actor":"Russell Crowe, Joaquin Phoenix, Connie Nielsen, Oliver Reed","plot":"When a Roman general is betrayed and his family murdered by an emperor's corrupt son, he comes to Rome as a gladiator to seek revenge.","imdbScore":"8.5","wasLiked":false},"105":{"id":105,"title":"Back to the Future","year":"1985","genre":"Adventure, Comedy, Sci-Fi","director":"Robert Zemeckis","actor":"Michael J. Fox, Christopher Lloyd, Lea Thompson, Crispin Glover","plot":"A teenager is accidentally sent 30 years into the past in a time-traveling DeLorean invented by his friend, Dr. Emmett Brown, and must make sure his high-school-age parents unite in order to save his own existence.","imdbScore":"8.5","wasLiked":false},"107":{"id":107,"title":"Snatch.","year":"2000","genre":"Crime, Thriller","director":"Guy Ritchie","actor":"Jason Statham, Brad Pitt, Benicio Del Toro, Dennis Farina","plot":"Unscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers, and supposedly Jewish jewelers fight to track down a priceless stolen diamond.","imdbScore":"8.3","wasLiked":false},"114":{"id":114,"title":"Pretty Woman","year":"1990","genre":"Comedy, Romance","director":"Garry Marshall","actor":"Richard Gere, Julia Roberts, Jason Alexander, Laura San Giacomo","plot":"A man in a legal but hurtful business needs an escort for some social events, and hires a beautiful prostitute he meets... only to fall in love.","imdbScore":"6.8","wasLiked":false},"120":{"id":120,"title":"The Lord of the Rings: The Fellowship of the Ring","year":"2001","genre":"Action, Adventure, Fantasy","director":"Peter Jackson","actor":"Elijah Wood, Ian McKellen, Orlando Bloom, Sean Bean","plot":"A meek hobbit of The Shire and eight companions set out on a journey to Mount Doom to destroy the One Ring and the dark lord Sauron.","imdbScore":"8.8","wasLiked":false},"121":{"id":121,"title":"The Lord of the Rings: The Two Towers","year":"2002","genre":"Action, Adventure, Fantasy","director":"Peter Jackson","actor":"Elijah Wood, Ian McKellen, Viggo Mortensen, Orlando Bloom","plot":"While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.","imdbScore":"8.7","wasLiked":false},"122":{"id":122,"title":"The Lord of the Rings: The Return of the King","year":"2003","genre":"Action, Adventure, Fantasy","director":"Peter Jackson","actor":"Elijah Wood, Viggo Mortensen, Ian McKellen, Orlando Bloom","plot":"Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.","imdbScore":"8.9","wasLiked":false},"134":{"id":134,"title":"O Brother, Where Art Thou?","year":"2000","genre":"Comedy, Adventure, Crime, Music","director":"Joel Coen","actor":"George Clooney, John Turturro, Tim Blake Nelson, John Goodman","plot":"In the deep south during the 1930s, three escaped convicts search for hidden treasure while a relentless lawman pursues them.","imdbScore":"7.8","wasLiked":false},"141":{"id":141,"title":"Donnie Darko","year":"2001","genre":"Drama, Mystery, Sci-Fi","director":"Richard Kelly","actor":"Jake Gyllenhaal, Jena Malone, Mary McDonnell, Holmes Osborne","plot":"A troubled teenager is plagued by visions of a large bunny rabbit that manipulates him to commit a series of crimes, after narrowly escaping a bizarre accident.","imdbScore":"8.1","wasLiked":false},"146":{"id":146,"title":"Crouching Tiger, Hidden Dragon","year":"2000","genre":"Action, Adventure, Drama, Fantasy, Romance","director":"Ang Lee","actor":"Yun-Fat Chow, Michelle Yeoh, Ziyi Zhang, Chen Chang","plot":"Two warriors in pursuit of a stolen sword and a notorious fugitive are led to an impetuous, physically skilled, adolescent nobleman's daughter, who is at a crossroads in her life.","imdbScore":"7.9","wasLiked":false},"153":{"id":153,"title":"Lost in Translation","year":"2003","genre":"Drama","director":"Sofia Coppola","actor":"Bill Murray, Scarlett Johansson, Giovanni Ribisi, Anna Faris","plot":"A faded movie star and a neglected young wife form an unlikely bond after crossing paths in Tokyo.","imdbScore":"7.8","wasLiked":false},"155":{"id":155,"title":"The Dark Knight","year":"2008","genre":"Action, Crime, Drama, Thriller","director":"Christopher Nolan","actor":"Christian Bale, Heath Ledger, Aaron Eckhart, Michael Caine","plot":"When Batman, Gordon and Harvey Dent launch an assault on the mob, they let the clown out of the box, the Joker, bent on turning Gotham on itself and bringing any heroes down to his level.","imdbScore":"9.0","wasLiked":false},"161":{"id":161,"title":"Ocean's Eleven","year":"2001","genre":"Crime, Thriller","director":"Steven Soderbergh","actor":"George Clooney, Brad Pitt, Julia Roberts, Matt Damon","plot":"Danny Ocean and his eleven accomplices plan to rob three Las Vegas casinos simultaneously.","imdbScore":"7.7","wasLiked":false},"180":{"id":180,"title":"Minority Report","year":"2002","genre":"Action, Mystery, Sci-Fi, Thriller","director":"Steven Spielberg","actor":"Tom Cruise, Colin Farrell, Samantha Morton, Max von Sydow","plot":"In a future where a special police unit is able to arrest murderers before they commit their crimes, an officer from that unit is himself accused of a future murder.","imdbScore":"7.7","wasLiked":false},"187":{"id":187,"title":"Sin City","year":"2005","genre":"Crime, Thriller","director":"Frank Miller, Robert Rodriguez","actor":"Mickey Rourke, Clive Owen, Bruce Willis, Jessica Alba","plot":"A film that explores the dark and miserable town, Basin City, and tells the story of three different people, all caught up in violent corruption.","imdbScore":"8.2","wasLiked":false},"194":{"id":194,"title":"Amélie","year":"2001","genre":"Drama","director":"Jean-Pierre Jeunet","actor":"Audrey Tautou, Mathieu Kassovitz, Rufus, Lorella Cravotta","plot":"Amelie, an innocent and naive girl in Paris, with her own sense of justice, decides to help those around her and along the way, discovers love.","imdbScore":"8.5","wasLiked":false},"197":{"id":197,"title":"Braveheart","year":"1995","genre":"Action, Biography, Drama, History, War","director":"Mel Gibson","actor":"Mel Gibson, Sophie Marceau, Patrick McGoohan, Angus Macfadyen","plot":"When his secret bride is executed for assaulting an English soldier whom tried to rape her, a commoner begins a revolt and leads Scottish warriors against the cruel English tyrant who rules Scotland with an iron-fist.","imdbScore":"8.4","wasLiked":false},"238":{"id":238,"title":"The Godfather","year":"1972","genre":"Crime, Drama","director":"Francis Ford Coppola","actor":"Marlon Brando, Al Pacino, James Caan, Diane Keaton","plot":"The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.","imdbScore":"9.2","wasLiked":false},"243":{"id":243,"title":"High Fidelity","year":"2000","genre":"Comedy, Drama, Music, Romance","director":"Stephen Frears","actor":"John Cusack, Iben Hjejle, Todd Louiso, Jack Black","plot":"Rob, a record store owner and compulsive list maker, recounts his top five breakups, including the one in progress.","imdbScore":"7.5","wasLiked":false},"268":{"id":268,"title":"Batman","year":"1989","genre":"Action, Fantasy","director":"Tim Burton","actor":"Michael Keaton, Jack Nicholson, Kim Basinger, Robert Wuhl","plot":"The Dark Knight of Gotham City begins his war on crime with his first major enemy being the clownishly homicidal Joker.","imdbScore":"7.6","wasLiked":false},"272":{"id":272,"title":"Batman Begins","year":"2005","genre":"Action, Adventure, Crime, Drama","director":"Christopher Nolan","actor":"Christian Bale, Michael Caine, Ken Watanabe, Liam Neeson","plot":"After training with his mentor, Batman begins his war on crime to free the crime-ridden Gotham City from corruption that the Scarecrow and the League of Shadows have cast upon it.","imdbScore":"8.3","wasLiked":false},"274":{"id":274,"title":"The Silence of the Lambs","year":"1991","genre":"Crime, Drama, Thriller","director":"Jonathan Demme","actor":"Jodie Foster, Anthony Hopkins, Lawrence A. Bonney, Kasi Lemmons","plot":"A young F.B.I. cadet must confide in an incarcerated and manipulative killer to receive his help on catching another serial killer who skins his victims.","imdbScore":"8.7","wasLiked":false},"275":{"id":275,"title":"Fargo","year":"1996","genre":"Crime, Drama, Thriller","director":"Joel Coen","actor":"William H. Macy, Frances McDormand, Steve Buscemi, Peter Stormare","plot":"Jerry Lundegaard's inept crime falls apart due to his and his henchmen's bungling and the persistent police work of the quite pregnant Marge Gunderson.","imdbScore":"8.2","wasLiked":false},"278":{"id":278,"title":"The Shawshank Redemption","year":"1994","genre":"Crime, Drama","director":"Frank Darabont","actor":"Tim Robbins, Morgan Freeman, Bob Gunton, William Sadler","plot":"Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.","imdbScore":"9.3","wasLiked":false},"280":{"id":280,"title":"Terminator 2: Judgment Day","year":"1991","genre":"Action, Sci-Fi, Thriller","director":"James Cameron","actor":"Arnold Schwarzenegger, Linda Hamilton, Edward Furlong, Robert Patrick","plot":"The cyborg who once tried to kill Sarah Connor is dead, and another T-101 must now protect her teenage son, John Connor, from an even more powerful and advanced Terminator, the T-1000.","imdbScore":"8.6","wasLiked":false},"329":{"id":329,"title":"Jurassic Park","year":"1993","genre":"Adventure, Sci-Fi","director":"Steven Spielberg","actor":"Sam Neill, Laura Dern, Jeff Goldblum, Richard Attenborough","plot":"During a preview tour, a theme park suffers a major power breakdown that allows its cloned dinosaur exhibits to run amok.","imdbScore":"8.0","wasLiked":false},"393":{"id":393,"title":"Kill Bill: Vol. 2","year":"2004","genre":"Action, Crime, Thriller","director":"Quentin Tarantino","actor":"Uma Thurman, David Carradine, Michael Madsen, Daryl Hannah","plot":"The Bride continues her vengeful quest against her former boss and lover Bill, the reclusive bouncer Budd, and the treacherous, one-eyed Elle.","imdbScore":"8.0","wasLiked":false},"414":{"id":414,"title":"Batman Forever","year":"1995","genre":"Action, Adventure, Fantasy","director":"Joel Schumacher","actor":"Val Kilmer, Tommy Lee Jones, Jim Carrey, Nicole Kidman","plot":"Batman must battle Two-Face and The Riddler with help of an amourous psychologist and a young circus acrobat who becomes his sidekick, Robin.","imdbScore":"5.4","wasLiked":false},"424":{"id":424,"title":"Schindler's List","year":"1993","genre":"Biography, Drama, History, War","director":"Steven Spielberg","actor":"Liam Neeson, Ralph Fiennes, Ben Kingsley, Caroline Goodall","plot":"In Poland during World War II, Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.","imdbScore":"8.9","wasLiked":false},"453":{"id":453,"title":"A Beautiful Mind","year":"2001","genre":"Biography, Drama","director":"Ron Howard","actor":"Russell Crowe, Ed Harris, Jennifer Connelly, Christopher Plummer","plot":"After a brilliant but asocial mathematician accepts secret work in cryptography, his life takes a turn to the nightmarish.","imdbScore":"8.1","wasLiked":false},"462":{"id":462,"title":"Erin Brockovich","year":"2000","genre":"Biography, Drama","director":"Steven Soderbergh","actor":"Julia Roberts, Albert Finney, David Brisbin, Dawn Didawick","plot":"An unemployed single mother becomes a legal assistant and almost single-handedly brings down a California power company accused of polluting a city's water supply.","imdbScore":"7.2","wasLiked":false},"550":{"id":550,"title":"Fight Club","year":"1999","genre":"Drama","director":"David Fincher","actor":"Brad Pitt, Edward Norton, Helena Bonham Carter, Meat Loaf","plot":"An insomniac office worker looking for a way to change his life crosses paths with a devil-may-care soap maker and they form an underground fight club that evolves into something much, much more...","imdbScore":"8.9","wasLiked":false},"557":{"id":557,"title":"Spider-Man","year":"2002","genre":"Action, Fantasy","director":"Sam Raimi","actor":"Tobey Maguire, Kirsten Dunst, Willem Dafoe, James Franco","plot":"When bitten by a genetically modified spider, a nerdy, shy, and awkward high school student gains spider-like abilities that he eventually must use to fight evil as a superhero after tragedy befalls his family.","imdbScore":"7.3","wasLiked":false},"558":{"id":558,"title":"Spider-Man 2","year":"2004","genre":"Action, Adventure, Fantasy","director":"Sam Raimi","actor":"Tobey Maguire, Kirsten Dunst, Alfred Molina, James Franco","plot":"Peter Parker is beset with troubles in his failing personal life as he battles a brilliant scientist named Doctor Otto Octavius.","imdbScore":"7.4","wasLiked":false},"568":{"id":568,"title":"Apollo 13","year":"1995","genre":"Adventure, Drama, History","director":"Ron Howard","actor":"Tom Hanks, Bill Paxton, Kevin Bacon, Gary Sinise","plot":"Three astronauts must devise a strategy to return to Earth safely after their spacecraft undergoes massive internal damage.","imdbScore":"7.5","wasLiked":false},"581":{"id":581,"title":"Dances with Wolves","year":"1990","genre":"Adventure, Drama, Western","director":"Kevin Costner","actor":"Kevin Costner, Mary McDonnell, Graham Greene, Rodney A. Grant","plot":"Lt. John Dunbar, exiled to a remote western Civil War outpost, befriends wolves and Indians, making him an intolerable aberration in the military.","imdbScore":"8.0","wasLiked":false},"585":{"id":585,"title":"Monsters Inc.","year":"2001","genre":"Animation, Adventure, Comedy, Family, Fantasy","director":"Pete Docter, David Silverman","actor":"Billy Crystal, John Goodman, Mary Gibbs, Steve Buscemi","plot":"Monsters generate their city's power by scaring children, but they are terribly afraid themselves of being contaminated by children, so when one enters Monstropolis, top scarer Sulley finds his world disrupted.","imdbScore":"8.0","wasLiked":false},"597":{"id":597,"title":"Titanic","year":"1997","genre":"Drama, Romance","director":"James Cameron","actor":"Leonardo DiCaprio, Kate Winslet, Billy Zane, Kathy Bates","plot":"A seventeen-year-old aristocrat, expecting to be married to a rich claimant by her mother, falls in love with a kind but poor artist aboard the luxurious, ill-fated R.M.S. Titanic.","imdbScore":"7.6","wasLiked":false},"601":{"id":601,"title":"E.T. the Extra-Terrestrial","year":"1982","genre":"Adventure, Family, Fantasy, Sci-Fi","director":"Steven Spielberg","actor":"Henry Thomas, Drew Barrymore, Peter Coyote, Dee Wallace","plot":"A meek and alienated little boy finds a stranded extraterrestrial. He has to find the courage to defy the authorities to help the alien return to its home planet.","imdbScore":"7.9","wasLiked":false},"602":{"id":602,"title":"Independence Day","year":"1996","genre":"Action, Sci-Fi","director":"Roland Emmerich","actor":"Will Smith, Bill Pullman, Jeff Goldblum, Mary McDonnell","plot":"The aliens are coming and their goal is to invade and destroy. Fighting superior technology, Man's best weapon is the will to survive.","imdbScore":"6.8","wasLiked":false},"603":{"id":603,"title":"The Matrix","year":"1999","genre":"Action, Adventure, Sci-Fi","director":"Andy Wachowski, Lana Wachowski","actor":"Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving","plot":"A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers.","imdbScore":"8.7","wasLiked":false},"604":{"id":604,"title":"The Matrix Reloaded","year":"2003","genre":"Action, Sci-Fi","director":"Andy Wachowski, Lana Wachowski","actor":"Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving","plot":"Neo and the rebel leaders estimate that they have 72 hours until 250,000 probes discover Zion and destroy it and its inhabitants. During this, Neo must decide how he can save Trinity from a dark fate in his dreams.","imdbScore":"7.1","wasLiked":false},"607":{"id":607,"title":"Men in Black","year":"1997","genre":"Comedy, Sci-Fi","director":"Barry Sonnenfeld","actor":"Tommy Lee Jones, Will Smith, Linda Fiorentino, Vincent D'Onofrio","plot":"A streetwise NYPD detective joins a secret organization that polices extraterrestrial affairs on Earth.","imdbScore":"7.2","wasLiked":false},"629":{"id":629,"title":"The Usual Suspects","year":"1995","genre":"Crime, Mystery, Thriller","director":"Bryan Singer","actor":"Kevin Spacey, Gabriel Byrne, Chazz Palminteri, Stephen Baldwin","plot":"A boat has been destroyed, criminals are dead, and the key to this mystery lies with the only survivor and his twisted, convoluted story beginning with five career crooks in a seemingly random police lineup.","imdbScore":"8.7","wasLiked":false},"640":{"id":640,"title":"Catch Me If You Can","year":"2002","genre":"Biography, Crime, Drama","director":"Steven Spielberg","actor":"Leonardo DiCaprio, Tom Hanks, Christopher Walken, Martin Sheen","plot":"A true story about Frank Abagnale Jr., who, before his 19th birthday, successfully conned millions of dollars' worth of checks as a Pan Am pilot, doctor, and legal prosecutor.","imdbScore":"7.9","wasLiked":false},"641":{"id":641,"title":"Requiem for a Dream","year":"2000","genre":"Drama","director":"Darren Aronofsky","actor":"Ellen Burstyn, Jared Leto, Jennifer Connelly, Marlon Wayans","plot":"The drug-induced utopias of four Coney Island individuals are shattered when their addictions become stronger.","imdbScore":"8.4","wasLiked":false},"664":{"id":664,"title":"Twister","year":"1996","genre":"Action, Adventure, Drama, Thriller","director":"Jan de Bont","actor":"Helen Hunt, Bill Paxton, Cary Elwes, Jami Gertz","plot":"Bill and Jo Harding, advanced storm chasers on the brink of divorce, must join together to create an advanced weather alert system by putting themselves in the cross-hairs of extremely violent tornadoes.","imdbScore":"6.1","wasLiked":false},"671":{"id":671,"title":"Harry Potter and the Sorcerer's Stone","year":"2001","genre":"Adventure, Family, Fantasy","director":"Chris Columbus","actor":"Daniel Radcliffe, Rupert Grint, Richard Harris, Maggie Smith","plot":"Rescued from the outrageous neglect of his aunt and uncle, a young boy with a great destiny proves his worth while attending Hogwarts School of Witchcraft and Wizardry.","imdbScore":"7.3","wasLiked":false},"672":{"id":672,"title":"Harry Potter and the Chamber of Secrets","year":"2002","genre":"Adventure, Family, Fantasy, Mystery","director":"Chris Columbus","actor":"Daniel Radcliffe, Rupert Grint, Emma Watson, Richard Harris","plot":"Harry ignores warnings not to return to Hogwarts, only to find the school plagued by a series of mysterious attacks and a strange voice haunting him.","imdbScore":"7.2","wasLiked":false},"680":{"id":680,"title":"Pulp Fiction","year":"1994","genre":"Crime, Drama, Thriller","director":"Quentin Tarantino","actor":"John Travolta, Uma Thurman, Samuel L. Jackson, Bruce Willis","plot":"The lives of two mob hit men, a boxer, a gangster's wife, and a pair of diner bandits intertwine in four tales of violence and redemption.","imdbScore":"9.0","wasLiked":false},"745":{"id":745,"title":"The Sixth Sense","year":"1999","genre":"Drama, Mystery, Thriller","director":"M. Night Shyamalan","actor":"Bruce Willis, Haley Joel Osment, Toni Collette, Olivia Williams","plot":"A boy who communicates with spirits that don't know they're dead seeks the help of a disheartened child psychologist.","imdbScore":"8.2","wasLiked":false},"752":{"id":752,"title":"V for Vendetta","year":"2005","genre":"Action, Crime, Fantasy, Mystery, Sci-Fi, Thriller","director":"James McTeigue","actor":"Hugo Weaving, Natalie Portman, Rupert Graves, Stephen Rea","plot":"A shadowy freedom fighter known only as 'V' uses guerrilla tactics to fight against his terrorist, totalitarian society. Upon rescuing a girl from the secret police, he also finds his best chance at having an ally.","imdbScore":"8.2","wasLiked":false},"786":{"id":786,"title":"Almost Famous","year":"2000","genre":"Drama, Music","director":"Cameron Crowe","actor":"Billy Crudup, Frances McDormand, Kate Hudson, Jason Lee","plot":"A high-school boy is given the chance to write a story for Rolling Stone Magazine about an up-and-coming rock band as he accompanies it on their concert tour.","imdbScore":"7.9","wasLiked":false},"788":{"id":788,"title":"Mrs. Doubtfire","year":"1993","genre":"Comedy, Drama","director":"Chris Columbus","actor":"Robin Williams, Sally Field, Pierce Brosnan, Harvey Fierstein","plot":"After a bitter divorce, an actor disguises himself as a female housekeeper to spend time with his children held in custody by his former wife.","imdbScore":"6.7","wasLiked":false},"807":{"id":807,"title":"Seven","year":"1979","genre":"Action, Drama","director":"Andy Sidaris","actor":"William Smith, John Alderman, Henry Ayau, Sandra Bernadou","plot":"A government agent discovers a plot by a cartel of seven gangsters to take over the state of Hawaii. He hires a team of seven hitmen to stop them.","imdbScore":"5.9","wasLiked":false},"808":{"id":808,"title":"Shrek","year":"2001","genre":"Animation, Adventure, Comedy, Family, Fantasy","director":"Andrew Adamson, Vicky Jenson","actor":"Mike Myers, Eddie Murphy, Cameron Diaz, John Lithgow","plot":"An ogre, in order to regain his swamp, travels along with an annoying donkey in order to bring a princess to a scheming lord, wishing himself King.","imdbScore":"7.9","wasLiked":false},"809":{"id":809,"title":"Shrek 2","year":"2004","genre":"Animation, Adventure, Comedy, Family, Fantasy","director":"Andrew Adamson, Kelly Asbury","actor":"Mike Myers, Eddie Murphy, Cameron Diaz, Julie Andrews","plot":"Princess Fiona's parents invite her and Shrek to dinner to celebrate her marriage. If only they knew the newlyweds were both ogres.","imdbScore":"7.3","wasLiked":false},"812":{"id":812,"title":"Aladdin","year":"1992","genre":"Animation, Adventure, Comedy, Family, Fantasy, Musical, Romance","director":"Ron Clements, John Musker","actor":"Scott Weinger, Robin Williams, Linda Larkin, Jonathan Freeman","plot":"Aladdin, a street urchin, accidentally meets Princess Jasmine, who is in the city undercover. They love each other, but she can only marry a prince.","imdbScore":"7.9","wasLiked":false},"854":{"id":854,"title":"The Mask","year":"1994","genre":"Comedy, Crime, Fantasy, Romance","director":"Chuck Russell","actor":"Jim Carrey, Cameron Diaz, Peter Riegert, Peter Greene","plot":"Bank clerk Stanley Ipkiss is transformed into a manic super-hero when he wears a mysterious mask.","imdbScore":"6.8","wasLiked":false},"857":{"id":857,"title":"Saving Private Ryan","year":"1998","genre":"Action, Drama, War","director":"Steven Spielberg","actor":"Tom Hanks, Matt Damon, Tom Sizemore, Edward Burns","plot":"Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.","imdbScore":"8.6","wasLiked":false},"862":{"id":862,"title":"Toy Story","year":"1995","genre":"Animation, Adventure, Comedy, Family, Fantasy","director":"John Lasseter","actor":"Tom Hanks, Tim Allen, Don Rickles, Jim Varney","plot":"A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.","imdbScore":"8.3","wasLiked":false},"954":{"id":954,"title":"Mission: Impossible","year":"1996","genre":"Action, Adventure, Thriller","director":"Brian De Palma","actor":"Tom Cruise, Jon Voight, Emmanuelle Béart, Henry Czerny","plot":"An American agent, under false suspicion of disloyalty, must discover and expose the real spy without the help of his organization.","imdbScore":"7.0","wasLiked":false},"955":{"id":955,"title":"Mission: Impossible II","year":"2000","genre":"Action, Adventure, Thriller","director":"John Woo","actor":"Tom Cruise, Dougray Scott, Thandie Newton, Ving Rhames","plot":"A secret agent is sent to Sydney, to find and destroy a genetically modified disease called 'Chimera'","imdbScore":"5.9","wasLiked":false},"1422":{"id":1422,"title":"The Departed","year":"2006","genre":"Crime, Drama, Thriller","director":"Martin Scorsese","actor":"Leonardo DiCaprio, Matt Damon, Jack Nicholson, Mark Wahlberg","plot":"An undercover state cop who has infiltrated an Irish gang and a mole in the police force working for the same mob race to track down and identify each other before being exposed to the enemy, after both sides realize their outfit has a rat.","imdbScore":"8.5","wasLiked":false},"1572":{"id":1572,"title":"Die Hard: With a Vengeance","year":"1995","genre":"Action, Crime, Thriller","director":"John McTiernan","actor":"Bruce Willis, Jeremy Irons, Samuel L. Jackson, Graham Greene","plot":"John McClane and a Harlem store owner are targeted by German terrorist Simon Gruber in New York City, where he plans to rob the Federal Reserve Building.","imdbScore":"7.5","wasLiked":false},"1597":{"id":1597,"title":"Meet the Parents","year":"2000","genre":"Comedy, Romance","director":"Jay Roach","actor":"Ben Stiller, Robert De Niro, Teri Polo, Blythe Danner","plot":"Male nurse Greg Focker meets his girlfriend's parents before proposing, but her suspicious father is every date's worst nightmare.","imdbScore":"7.0","wasLiked":false},"1637":{"id":1637,"title":"Speed","year":"1994","genre":"Action, Thriller","director":"Jan de Bont","actor":"Keanu Reeves, Dennis Hopper, Sandra Bullock, Joe Morton","plot":"A young cop must prevent a bomb exploding aboard a city bus by keeping its speed above 50 mph.","imdbScore":"7.2","wasLiked":false},"1891":{"id":1891,"title":"Star Wars: Episode V - The Empire Strikes Back","year":"1980","genre":"Action, Adventure, Sci-Fi","director":"Irvin Kershner","actor":"Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams","plot":"After the rebels have been brutally overpowered by the Empire on their newly established base, Luke Skywalker takes advanced Jedi training with Master Yoda, while his friends are pursued by Darth Vader as part of his plan to capture Luke.","imdbScore":"8.8","wasLiked":false},"1892":{"id":1892,"title":"Star Wars: Episode VI - Return of the Jedi","year":"1983","genre":"Action, Adventure, Fantasy, Sci-Fi","director":"Richard Marquand","actor":"Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams","plot":"After rescuing Han Solo from the palace of Jabba the Hutt, the Rebels attempt to destroy the Second Death Star, while Luke Skywalker tries to bring his father back to the Light Side of the Force.","imdbScore":"8.4","wasLiked":false},"1894":{"id":1894,"title":"Star Wars: Episode II - Attack of the Clones","year":"2002","genre":"Action, Adventure, Fantasy, Sci-Fi","director":"George Lucas","actor":"Hayden Christensen, Natalie Portman, Ewan McGregor, Christopher Lee","plot":"Ten years later, Anakin Skywalker shares a forbidden romance with Padmé, while Obi-Wan investigates an assassination attempt on the Princess and discovers a secret clone army crafted for the Jedi.","imdbScore":"6.7","wasLiked":false},"1900":{"id":1900,"title":"Traffic","year":"2000","genre":"Crime, Drama, Thriller","director":"Steven Soderbergh","actor":"Michael Douglas, Benicio Del Toro, Catherine Zeta-Jones, Jacob Vargas","plot":"A conservative judge is appointed by the President to spearhead America's escalating war against drugs, only to discover that his teenage daughter is an addict.","imdbScore":"7.7","wasLiked":false},"2024":{"id":2024,"title":"The Patriot","year":"2000","genre":"Action, Drama, War","director":"Roland Emmerich","actor":"Mel Gibson, Heath Ledger, Joely Richardson, Jason Isaacs","plot":"Peaceful farmer Benjamin Martin is driven to lead the Colonial Militia during the American Revolution when a sadistic British officer murders his son.","imdbScore":"7.0","wasLiked":false},"2164":{"id":2164,"title":"Stargate","year":"1994","genre":"Action, Adventure, Sci-Fi","director":"Roland Emmerich","actor":"Kurt Russell, James Spader, Alexis Cruz, Viveca Lindfors","plot":"An interstellar teleportation device, found in Egypt, leads to a planet with humans resembling ancient Egyptians who worship the god Ra.","imdbScore":"6.9","wasLiked":false},"2501":{"id":2501,"title":"The Bourne Identity","year":"2002","genre":"Action, Mystery, Thriller","director":"Doug Liman","actor":"Franka Potente, Matt Damon, Chris Cooper, Clive Owen","plot":"A man is picked up by a fishing boat, bullet-riddled and without memory, then races to elude assassins and recover from amnesia.","imdbScore":"7.9","wasLiked":false},"2502":{"id":2502,"title":"The Bourne Supremacy","year":"2004","genre":"Action, Crime, Thriller","director":"Paul Greengrass","actor":"Matt Damon, Franka Potente, Joan Allen, Brian Cox","plot":"When Jason Bourne is framed for a botched CIA operation he is forced to take up his former life as a trained assassin to survive.","imdbScore":"7.7","wasLiked":false},"3049":{"id":3049,"title":"Ace Ventura: Pet Detective","year":"1994","genre":"Comedy","director":"Tom Shadyac","actor":"Jim Carrey, Courteney Cox, Sean Young, Tone Loc","plot":"A goofy detective specializing in animals goes in search of a missing dolphin mascot of a football team.","imdbScore":"6.8","wasLiked":false},"4327":{"id":4327,"title":"Charlie's Angels","year":"2000","genre":"Action, Adventure, Comedy, Crime, Thriller","director":"McG","actor":"Cameron Diaz, Drew Barrymore, Lucy Liu, Bill Murray","plot":"Three women, detectives with a mysterious boss, retrieve stolen voice-ID software, using martial arts, tech skills, and sex appeal.","imdbScore":"5.5","wasLiked":false},"5503":{"id":5503,"title":"The Fugitive","year":"1993","genre":"Action, Adventure, Crime, Mystery, Thriller","director":"Andrew Davis","actor":"Harrison Ford, Tommy Lee Jones, Sela Ward, Julianne Moore","plot":"Dr. Richard Kimble, unjustly accused of murdering his wife, must find the real killer while being the target of a nationwide manhunt.","imdbScore":"7.8","wasLiked":false},"7443":{"id":7443,"title":"Chicken Run","year":"2000","genre":"Animation, Family, Comedy","director":"Peter Lord, Nick Park","actor":"Mel Gibson, Julia Sawalha, Phil Daniels, Lynn Ferguson","plot":"Chicken Run is a comedy escape drama with a touch of passion set on a sinister Yorks chicken farm in 1950's England","imdbScore":"7.1","wasLiked":false},"8358":{"id":8358,"title":"Cast Away","year":"2000","genre":"Adventure, Drama","director":"Robert Zemeckis","actor":"Tom Hanks, Helen Hunt, Paul Sanchez, Lari White","plot":"A FedEx executive must transform himself physically and emotionally to survive a crash landing on a deserted island.","imdbScore":"7.6","wasLiked":false},"8467":{"id":8467,"title":"Dumb","year":"2008","genre":"Animation, Comedy, Drama","director":"David Cromer","actor":"Scott Adsit, David Herman, Jay Johnston, Carolyn Lawrence","plot":"N/A","imdbScore":"8.0","wasLiked":false},"8587":{"id":8587,"title":"The Lion King","year":"1994","genre":"Animation, Adventure, Drama, Family, Musical","director":"Roger Allers, Rob Minkoff","actor":"Matthew Broderick, Jeremy Irons, James Earl Jones, Whoopi Goldberg","plot":"Tricked into thinking he killed his father, a guilt ridden lion cub flees into exile and abandons his identity as the future King.","imdbScore":"8.4","wasLiked":false},"9331":{"id":9331,"title":"Clear and Present Danger","year":"1994","genre":"Action, Drama, Thriller","director":"Phillip Noyce","actor":"Harrison Ford, Willem Dafoe, Anne Archer, Joaquim de Almeida","plot":"CIA Analyst Jack Ryan is drawn into an illegal war fought by the US government against a Colombian drug cartel.","imdbScore":"6.8","wasLiked":false},"9741":{"id":9741,"title":"Unbreakable","year":"2000","genre":"Drama, Mystery, Sci-Fi, Thriller","director":"M. Night Shyamalan","actor":"Bruce Willis, Samuel L. Jackson, Robin Wright, Spencer Treat Clark","plot":"A suspense thriller with supernatural overtones that revolves around a man who learns something extraordinary about himself after a devastating accident.","imdbScore":"7.2","wasLiked":false},"9802":{"id":9802,"title":"The Rock","year":"1996","genre":"Action, Adventure, Thriller","director":"Michael Bay","actor":"Sean Connery, Nicolas Cage, Ed Harris, John Spencer","plot":"A mild-mannered chemist and an ex-con must lead the counterstrike when a rogue group of military men, led by a renegade general, threaten a nerve gas attack from Alcatraz against San Francisco.","imdbScore":"7.3","wasLiked":false},"9806":{"id":9806,"title":"The Incredibles","year":"2004","genre":"Animation, Action, Adventure, Family","director":"Brad Bird","actor":"Craig T. Nelson, Samuel L. Jackson, Holly Hunter, Jason Lee","plot":"A family of undercover superheroes, while trying to live the quiet suburban life, are forced into action to save the world.","imdbScore":"8.0","wasLiked":false},"10020":{"id":10020,"title":"Beauty and the Beast","year":"1991","genre":"Animation, Family, Fantasy, Musical, Romance","director":"Gary Trousdale, Kirk Wise","actor":"Paige O'Hara, Robby Benson, Richard White, Jerry Orbach","plot":"Belle, whose father is imprisoned by the Beast, offers herself instead and discovers her captor to be an enchanted prince.","imdbScore":"8.0","wasLiked":false},"36657":{"id":36657,"title":"X-Men","year":"2000","genre":"Action, Adventure, Sci-Fi","director":"Bryan Singer","actor":"Patrick Stewart, Hugh Jackman, Ian McKellen, Famke Janssen","plot":"Two mutants come to a private academy for their kind whose resident superhero team must oppose a terrorist organization with similar powers.","imdbScore":"7.4","wasLiked":false},"36658":{"id":36658,"title":"X-Men: The Last Stand","year":"2006","genre":"Action, Adventure, Sci-Fi, Thriller","director":"Brett Ratner","actor":"Patrick Stewart, Hugh Jackman, Halle Berry, Famke Janssen","plot":"When a cure is found to treat mutations, lines are drawn amongst the X-Men, led by Professor Charles Xavier, and the Brotherhood, a band of powerful mutants organized under Xavier's former ally, Magneto.","imdbScore":"6.8","wasLiked":false},"36955":{"id":36955,"title":"True Lies","year":"1994","genre":"Action, Thriller","director":"James Cameron","actor":"Arnold Schwarzenegger, Jamie Lee Curtis, Tom Arnold, Bill Paxton","plot":"Harry Tasker is a secret agent for the United States Government. For years, he has kept his job from his wife, but is forced to reveal his identity and try to stop nuclear terrorists when he and his wife are kidnapped by the terrorists.","imdbScore":"7.2","wasLiked":false}}